studies/effective-slip-length/partialSlipStudy/blockmesh-refinemesh-workflow-wedge-case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.2;

//functions
//{
//    sampleLine
//    {
//        type sets;
//        libs            (sampling);
//
//        interpolationScheme cell;
//
//        setFormat       csv;
//
//        sets
//        (
//            data
//            {
//                type    uniform;
//                axis    x;
//                start   (0 0 #calc "float(0.001831/1000/2)");
//                end     (32e-3 0 #calc "float(0.001831/1000/2)");
//                nPoints 200;
//            }
//        );
//
//        fields          (U);
//    }
//
//    forces
//    {
//        type                  forces;
//        libs                  ("libforces.so");
//        patches               ("bottom");
//        p                     p;
//        u                     U;
//        CofR                  (0 0 0);
//        rho                   rhoInf;
//        rhoInf                828;
//        writeControl          timeStep;
//        writeInterval         10;
//    }
//}

// ************************************************************************* //
