studies/effective-slip-length/partialSlipStudy/blockmesh-refinemesh-workflow-wedge-case/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
   // default         Euler;
      default      steadyState;
}

gradSchemes
{
    default     Gauss linear;
//    grad(U)     Gauss linear;
//    grad(p)     Gauss linear;
}

divSchemes
{
    default         none;

    div(phi,U)     bounded Gauss linearUpwind grad(U);
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
//    div(phi,k)      bounded Gauss limitedLinear 1;
//    div(phi,epsilon) bounded Gauss limitedLinear 1;
//    div(phi,omega) bounded Gauss limitedLinear 1;
//    div(phi,v2) bounded Gauss limitedLinear 1;
    div(nonlinearStress) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;

   // laplacian(nuEff,U) Gauss linear uncorrected;
   // laplacian((1|A(U)),p) Gauss linear uncorrected; 
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
