studies/effective-slip-length/partialSlipStudy/blockmesh-refinemesh-workflow-wedge-case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
       // cacheAgglomeration no;
    }

    pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }

    "pcorr.*"
    {
        $p
        tolerance       0.02;
        relTol          0;
    }

   U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    UFinal
    {
        $U;
        tolerance       1e-05;
        relTol          0;
    }

    cellMotionUx
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0;
    }
}

SIMPLE
{
   // correctPhi          yes;
   // nOuterCorrectors    4;
   // nCorrectors         3;//1
      nNonOrthogonalCorrectors 0;
      pRefCell            0;
      pRefValue           0;
      consistent          yes;
    residualControl
    {
        U 1e-3;
       // {
       //         tolerance  1e-5;
       //         relTol      0;
       // }
        p 1e-2;
       // {
       //         tolerance  5e-4;
       //         relTol      0;
       // }
        
    }


}

relaxationFactors
{
    equations
    { 
        U              0.9;
        ".*"           0.9;
    }
}


// ************************************************************************* //
